app/views/questions/_form.html.erb


    <%= form.collection_select :course_id, Course.all, :id, :title, {:include_blank => 'Please Select'}, {class: "dropdown-content my-1"} %>
      <br>
    <%= form.collection_select :category_id, Category.all, :id, :name , {}, {class: "dropdown-content my-1"} %>
---
SELECT "courses".* FROM "courses"
SELECT "categories".* FROM "categories"