app/views/questions/index.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]
---
        <li><%= link_to question.content, question %>
            <% question.answers.each do |answer| %>