app/views/quizzes/new.html.erb

  <div class="select is-multiple">
    <%= collection_select(:course, :course_id, Course.all, :id, :title, {include_hidden: false}, {multiple: true, required: true, class: 'multiple'}) %>
---
SELECT "courses".* FROM "courses"