app/views/quizzes/show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 ORDER BY "answers"."id" ASC LIMIT $2  [["question_id", 9], ["LIMIT", 1]]
---
        <input type="input"  data-action="keydown->quiz#submitted" data-quiz-target="input" class="input is-primary is-medium">
        <p class="is-hidden" data-quiz-target="answer"><%= question.answers.first.content %></p>