app/views/answers/edit.html.erb


  <%= form.collection_select :question_id, Question.all, :id, :content , {}, {class: "dropdown-content my-1"} %>
---
SELECT "questions".* FROM "questions"