app/views/courses/show.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."course_id" = $1  [["course_id", 1]]
---
<ul>
<% @course.questions.each do |question| %>