app/controllers/questions_controller.rb

INSERT INTO "questions" ("content", "counter", "course_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "ggg"], ["counter", nil], ["course_id", 1], ["category_id", 1], ["created_at", "2022-06-21 14:19:40.999836"], ["updated_at", "2022-06-21 14:19:40.999836"]]
---
def create
    @question = Question.new(question_params)

    respond_to do |format|
        if @question.save

UPDATE "questions" SET "counter" = COALESCE("counter", 0) + $1 WHERE "questions"."id" = $2  [["counter", 1], ["id", 6]]
UPDATE "questions" SET "counter" = COALESCE("counter", 0) - $1 WHERE "questions"."id" = $2  [["counter", 1], ["id", 1]]
---
def update_counter
  if params[:count] == "1"
    @question.increment!(:counter)
  elsif params[:count] == "0"
    @question.decrement!(:counter)