app/controllers/quizzes_controller.rb

  def show
    number = params[:questions].to_i
    questions = Course.where(id: params[:course][:course_id]).includes(:questions).map(&:questions).flatten
    questions.shuffle! if params[:random]
    @questions = questions.take(number)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "questions".* FROM "questions" WHERE "questions"."course_id" IN ($1, $2)  [["course_id", 1], ["course_id", 2]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1  [["id", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."course_id" = $1  [["course_id", 1]]